# accounts/apps.py

# وارد کردن کلاس پایه AppConfig از جنگو
# این کلاس برای پیکربندی اپلیکیشن‌های جنگو استفاده می‌شود
from django.apps import AppConfig


class AccountsConfig(AppConfig):
    """
    تنظیمات اپلیکیشن accounts

    این کلاس به جنگو کمک می‌کند تا اپلیکیشن accounts را
    در زمان راه‌اندازی پروژه شناسایی، مقداردهی اولیه و مدیریت کند.
    همچنین می‌توان تنظیمات اختصاصی اپلیکیشن را اینجا تعریف کرد.
    """

    # تعیین نوع پیش‌فرض فیلد کلید اصلی در مدل‌ها
    # BigAutoField باعث می‌شود شناسه‌ها (ID) ظرفیت بالاتری داشته باشند
    default_auto_field = 'django.db.models.BigAutoField'

    # نام فنی اپلیکیشن که در کل پروژه استفاده می‌شود
    name = 'accounts'

    # نام نمایشی اپلیکیشن که در پنل ادمین جنگو نمایش داده می‌شود
    # این مقدار بیشتر برای خوانایی و رابط کاربری است
    verbose_name = 'مدیریت کاربران'

    def ready(self):
        """
        این متد هنگام آماده شدن اپلیکیشن (startup پروژه) اجرا می‌شود.

        کاربرد اصلی:
        - اتصال سیگنال‌ها (signals)
        - اجرای کدهای اولیه مورد نیاز اپلیکیشن
        - بارگذاری تنظیمات وابسته به اپلیکیشن

        نکته مهم:
        این متد فقط یک‌بار هنگام بالا آمدن جنگو اجرا می‌شود.
        """

        # ایمپورت سیگنال‌ها برای فعال شدن event ها در اپلیکیشن
        # noqa یعنی ابزارهای lint (مثل flake8) این خط را نادیده بگیرند
        import accounts.signals  # noqa